fonecmiddiplom120425/src/Documents/НачислениеЗаработнойПлаты/НачислениеЗаработнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗаработнойПлаты</name>
  <registerRecords>CalculationRegister.ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.Удержания</registerRecords>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>График</name>
      <type>
        <types>CatalogRef.Графики</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удержания</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Удержания</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУдержания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmiddiplom120425/src/CalculationRegisters/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <schedule>InformationRegister.ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботы.Resource.КоличествоДней</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.Графики</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmiddiplom120425/src/CalculationRegisters/Удержания/Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Удержания</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Удержания</chartOfCalculationTypes>
  <resources>
    <name>СуммаУдержания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmiddiplom120425/src/InformationRegisters/УсловияОплатыСотрудников/УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmiddiplom120425/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmiddiplom120425/src/AccumulationRegisters/ВзаиморасчетыССотрудниками/ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmiddiplom120425/src/Documents/НачислениеЗаработнойПлаты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПериодРегистрации = НачалоМесяца(Дата);
	
	Движения.ОсновныеНачисления.Записывать = Истина; 
	Для Каждого Строка Из СписокСотрудников Цикл
		Движение = Движения.ОсновныеНачисления.Добавить(); 
		ЗаполнитьЗначенияСвойств(Движение, Строка); 
		Движение.ПериодДействияНачало = Строка.ДатаНачала; 
		Движение.ПериодДействияКонец = КонецДня(Строка.ДатаОкончания);
		Движение.ПериодРегистрации = ПериодРегистрации; 
	КонецЦикла;
	
	Движения.ОсновныеНачисления.Записать();
	
	Движения.Удержания.Записывать = Истина; 
	Для Каждого Строка Из Удержания Цикл
		Движение = Движения.Удержания.Добавить(); 
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.ПериодРегистрации = ПериодРегистрации; 
	КонецЦикла;
	
	Движения.Удержания.Записать();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.КоличествоДнейПериодДействия, 0) КАК КоличествоДней,
		|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.КоличествоДнейФактическийПериодДействия, 0) КАК КоличествоДнейОтработано,
		|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_ДанныеГрафика
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(Регистратор = &Регистратор) КАК ОсновныеНачисленияДанныеГрафика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеГрафика.КоличествоДней КАК КоличествоДней,
		|	ВТ_ДанныеГрафика.КоличествоДнейОтработано КАК КоличествоДнейОтработано,
		|	УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
		|	УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот,
		|	ВТ_ДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ВТ_ДанныеГрафика.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_ДанныеОклада
		|ИЗ
		|	ВТ_ДанныеГрафика КАК ВТ_ДанныеГрафика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОплатыСотрудников.СрезПоследних(&ПериодРегистрации, ) КАК УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВТ_ДанныеГрафика.Сотрудник = УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеОклада.КоличествоДней КАК КоличествоДней,
		|	ВТ_ДанныеОклада.КоличествоДнейОтработано КАК КоличествоДнейОтработано,
		|	ВТ_ДанныеОклада.Оклад КАК Оклад,
		|	ВТ_ДанныеОклада.ПроцентОтРабот КАК ПроцентОтРабот,
		|	ВТ_ДанныеОклада.НомерСтроки КАК НомерСтроки,
		|	ВКМ_ВыполненныеСотрудникомРаботыОстатки.СуммаКОплатеОстаток КАК СуммаКОплатеПроцент,
		|	ВТ_ДанныеОклада.Сотрудник КАК Сотрудник
		|ИЗ
		|	ВТ_ДанныеОклада КАК ВТ_ДанныеОклада
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Остатки КАК ВКМ_ВыполненныеСотрудникомРаботыОстатки
		|		ПО ВТ_ДанныеОклада.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОстатки.Сотрудник";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СтавкаНДФЛ = Константы.ВКМ_СтавкаНДФЛ.Получить();
	СтавкаНДФЛ = (100 - СтавкаНДФЛ) / 100;
	
	Для каждого Движение Из Движения.ОсновныеНачисления Цикл
		Выборка.Сбросить(); 
		Выборка.НайтиСледующий(Движение.НомерСтроки, "НомерСтроки");
			
		Если Выборка.КоличествоДней <> 0 Тогда 
			Движение.Результат = Выборка.Оклад / Выборка.КоличествоДней * Выборка.КоличествоДнейОтработано * СтавкаНДФЛ; 	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.СуммаКОплатеПроцент) Тогда 
			Движение.Результат = Выборка.Оклад / Выборка.КоличествоДней * Выборка.КоличествоДнейОтработано;
			Движение.Результат = (Движение.Результат + Выборка.СуммаКОплатеПроцент) * СтавкаНДФЛ; 
		КонецЕсли; 
		
	КонецЦикла; 
		
    Движения.ОсновныеНачисления.Записать(, Истина); 
	
	Движения.ВзаиморасчетыССотрудниками.Записывать = Истина; 
	Для Каждого Строка Из СписокСотрудников Цикл
		Движение = Движения.ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;  
		Движение.Сотрудник = Строка.Сотрудник; 
		Движение.Сумма = ПолучитьСуммуОклада(Строка.Сотрудник, ПериодРегистрации);
		Движение.Период = ПериодРегистрации; 
	КонецЦикла;
	
	Движения.ВзаиморасчетыССотрудниками.Записать(); 
	
	Движения.ВзаиморасчетыССотрудниками.Записывать = Истина; 
	Для Каждого Строка Из Удержания Цикл
		Движение = Движения.ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;  
		Движение.Сотрудник = Строка.Сотрудник; 
		Движение.Сумма = Строка.СуммаУдержания;
		Движение.Период = ПериодРегистрации;
	КонецЦикла;   
	
	Движения.ВзаиморасчетыССотрудниками.Записать();	
	
КонецПроцедуры

Функция ПолучитьСуммуОклада(Сотрудник, ПериодРегистрации)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисления.Результат КАК Результат
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления КАК ОсновныеНачисления
		|ГДЕ
		|	ОсновныеНачисления.ПериодРегистрации = &ПериодРегистрации
		|	И ОсновныеНачисления.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Результат;  
	КонецЦикла;	
	
КонецФункции
